app/controllers/contacts_controller.rb

SELECT `contacts`.* FROM `contacts`
---
  def index
    @contacts = Contact.all

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `contacts`.* FROM `contacts` WHERE `contacts`.`userID` = 1
---
  def edit
    #@contact = Contact.find(params[:id])
    @user = User.find(params[:id])
    @contacts = Contact.find_all_by_userID(params[:id])

INSERT INTO `contacts` (`created_at`, `eMail`, `firstName`, `lastName`, `updated_at`, `userID`) VALUES ('2013-05-03 07:19:31', 'jhg', 'jf', 'jhg', '2013-05-03 07:19:31', NULL)
---
  def create
    @contact = Contact.new(params[:contact])

    respond_to do |format|
      if @contact.save

SELECT `contacts`.* FROM `contacts` WHERE `contacts`.`id` = 13 LIMIT 1
UPDATE `contacts` SET `eMail` = 'jim@jim.org', `firstName` = 'goodbye', `lastName` = 'hello', `updated_at` = '2013-05-04 02:07:44' WHERE `contacts`.`id` = 20
---
  def update
    @contact = Contact.find(params[:id])

    respond_to do |format|
      if @contact.update_attributes(params[:contact])

SELECT `contacts`.* FROM `contacts` WHERE `contacts`.`id` = 3 LIMIT 1
DELETE FROM `contacts` WHERE `contacts`.`id` = 17
---
  def destroy
    @contact = Contact.find(params[:id])
    @contact.destroy

SELECT `contacts`.* FROM `contacts` WHERE `contacts`.`id` = 13 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def edit2
    @contact = Contact.find(params[:id])
    @user = User.find(current_user.id)