app/controllers/home_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def index
  	if user_signed_in?
  		@user = User.find(current_user.id)