app/controllers/users_controller.rb

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
UPDATE `users` SET `firstName` = 'vincent', `lastName` = 'colonna', `state` = '', `hobbies` = '', `website` = '', `dateOfBirth` = '2013-04-26', `updated_at` = '2013-04-26 10:39:46' WHERE `users`.`id` = 1